ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV226/ESP32_WordClockV226.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino
 Changes V003: Clock and SK6812 LEDstrip working
...
 Changes V094: Replaced NIMBLE with ESP32 BLE
...
 Changes V130: Removed old coding and use NEOPIXEL and use ESPAsyncWebServer. 203222 l/s again instead of 140000
...
 Changes V199: All Rework in Webpage to CheckWIFIcommand(). 199a Clock logic in ClockLogic.h. Corrected double Menu i and ii on webpage when BLE open.
               Updated HTML and logging behaviour. Added option V background, Changed LDR reading when background is on, input decimal or hexadecimal, KURZ, EXACT etc bij Ulrich 4-talen weg
               Removed short LDR reading under X LDR_LED. NoTextInLeds in EveryHourUpdate -> end of function 
               lastminute = 99; -> end ReworkInputString .Cleanup code. 
 Changes V200: OTA logic improved
 Changes V201: LED near LDR on/off 
 Changes V202: HET IS WAS can also OFF in FOURLANGUAGECLOCK and VIERTALENKLOK
 Changes V203: Added CLOCK_VARIANT. renamed Mem.UseRotary -> Mem.TimeInput
 Changes V204: Resetbutton added  
 Changes V205: BLE bugs solved. Android did not see the broadcastname, uses now  pServer->disconnect(). Delay 30ms when not in fast mode.  
 Changes V206: When time is entered WIFI/NTP is Off. When DS3231 is turned Off with J and no valid WIFI credentials DS3231 stays On
 Changes V207: Added InitResetpin()
 Changes V208: Not used
 Changes V209: Removed Reset button. --> Press 9 times on rotary. Added NLM1M2M3M4L294 
 Changes V210: Stable version
 Changes V211: Optimised BuildHTML and Tekstprintlnf & Tekstprintf. CheckMCURestartCounter ->10 min
 Changes V212: RST_PIN in Mem.ResetPin 
 Changes V213: Optimised resetpin. RST_PIN in Mem.ResetPin. Comparable with ESP#@Arduino_CommV033
 Changes V214: Added Mem2 and Colourpicket HTML --> not working yet
 Changes V215: Optimised Colourpicket HTML
 Changes V216: Optimised Colourpicket HTML. Viertalenklok is working OK 
 Changes V217: Made print in ReworkInputString consistant. added background in Colourpicket HTML
 Changes V218: Optimised Colourpicket HTML for VIERTALENKLOK
 Changes V219: Optimised Colourpicket HTML for Single language clock
 Changes V220: Claude optimised TimeReceiver
 Changes V221: Cleanup code. No flickering with EDSoftLEd V1.10.0 
 Changes V222: combined Mem2 at bottom of Mem. Removed Mem data struct
 Changes V223: Added const uint32_t LEDNEARLDR in clockfaces.h to control LDR reading
 Changes V224: Added colourpicker.h to choose colours
 Changes V225: Corrected bugs, black after reset, DimmedLeds with SK6812 white LED. 
               Added French, English single language designes and corrected LED position in German design
 Changes V226: Renamed Laatzien to SelftestFlash with instant-abort behaviour, 
               added web settings menu (MenuPage.h) with sliders, 24h clock picker, and colour picker link.
               
*********************
How to compile: 
Install ESP32 boards
Board: ESP32 core version >3.2.0 
Partition Scheme: With FAT
Pin Numbering: By Arduino pin (default)     -- > with EdsoftLED both can be used
               By GPIO number (legacy)      -- > When using NEOpixel   Adafruit_NeoPixel/esp.c:78:(.text.espShow+0x55): undefined reference to `digitalPinToGPIONumber' when using By Arduino pin
USB mode: Normal (Tiny USB)
**********************

Select below, with only one #define selected, the clock variant

*/
// =============================================================================================================================
// ------------------>   Define only one clock type
#define NL144CLOCK              // Dutch display for 12 x 12 Front
//#define FOURLANGUAGECLOCK       // Four-language clock with 625 LEDs 
//#define NL92CLOCK               // Dutch display for one LED behind every character
//#define UK144CLOCK              // English display for 12 x 12 Front 
//#define FR144CLOCK              // French display for 12 x 12 Front
//#define DE144CLOCK              // German display for 12 x 12 Front
//#define NLM1M2M3M4L94           // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L161          // NL EdSoft Qclock design
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L294          // NL clock with four extra LEDs for the minutes to light up
//#define VIERTALENKLOK           // Viertalenklok Ulrich

//------------------------------------------------------------------------------              //
// ESP32 Definition of installed modules
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire

//------------------------------------------------------------------------------              //
// ESP32 Includes defines and initialisations
//-------------------------------------------

                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL (3, 3, 0)            // Use EdSoftLED with ESP32 compiler.
#define USEEDSOFTLED  // Use EdsoftLED >= V1.9.0 for SK6812. Saves 200-500 bytes compared with NeoPixel. To use NeoPixel is also OK but compile: By GPIO number (legacy)
                      #endif
                      #ifdef USEEDSOFTLED
#include <EdSoftLED.h>         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812 
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel  *** USE GPIO NUMBERING and compile By GPIO number (legacy) 
                      #endif
#include <Preferences.h>
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <WiFi.h>              // Used for web page 
#include <esp_sntp.h>          // for NTP
#include <esp_wps.h>           // For WPS
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/ESP32Async 
#include <Update.h>            // For Over-the-Air (OTA)
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 
#include <IRremote.hpp>        // IR remote control

