ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV226/ESP32_WordClockV226.ino
//--------------------------------------------                                                //
// NTP Notify
//--------------------------------------------
void NTPnotify(struct timeval* tv) { ntpJustSynced = true; }                                  // --- NTP time synchronized --- is printed later
//--------------------------------------------                                                //
// NTP Check and Print NTP if synced
//--------------------------------------------
void CheckandPrintNTPsynced(void)
{
 struct tm tm;
 time_t now = time(nullptr);
 localtime_r(&now, &tm); 
 if (Mem.TimeLogPrint != 0 )                                              // Do not print time but do update the display                                                              // do not Print the time string every minute
   { 
    Tekstprintlnf("-- NTP time synchronized --  %02d-%s-%04d %02d:%02d:%02d ",
           timeinfo.tm_mday,  monthNames[timeinfo.tm_mon],   // tm_mon is 0–11
           timeinfo.tm_year + 1900, timeinfo.tm_hour,
           timeinfo.tm_min,          timeinfo.tm_sec);
   }       
 ntpJustSynced = false;
}
//--------------------------------------------                                                //
// NTP Set time zone
//--------------------------------------------
void setTimezone(void) { setenv("TZ", Mem.Timezone, 1);  tzset(); }
//--------------------------------------------                                                //
// NTP Init NTP
//--------------------------------------------
void initSNTP(void) 
{  
 sntp_set_time_sync_notification_cb(NTPnotify);                                               // Optional: callback when time syncs
 configTime(0, 0, "pool.ntp.org", "time.nist.gov");                                           // 1 hour sync interval = default
 setTimezone();                                                                               // Must be set after configTime
}
//--------------------------------------------                                                //
// NTP Get a NTP time and wait max 2.5 sec 
//--------------------------------------------
bool wait4SNTP(void) 
{
 int32_t Tick = millis(); 
 bool SNTPtimeValid = true;
 while (sntp_get_sync_status() != SNTP_SYNC_STATUS_COMPLETED) 
  { if ((millis() - Tick) >2500) {SNTPtimeValid = false; break;}   }                          // Wait max 2.5 seconds 
return  SNTPtimeValid;
}

//--------------------------------------------                                                //
// WIFI Check for a Pending command received from the web page 
// Log SWversion to web page when Log = true
//--------------------------------------------
void BuildHTMLPage(bool Log)
{
 int i = 0;
 html_info[0] = 0;
 DoNotLog = !Log;
 SWversion();
 DoNotLog = false;
 
 size_t topLen    = strlen(index_html_top);
 size_t infoLen   = strlen(html_info);
 size_t footerLen = strlen(index_html_footer);
 size_t totalLen  = topLen + infoLen + footerLen;
 
 if (totalLen >= MAXSIZE_HTML_PAGE)
   {
    snprintf(HTML_page, MAXSIZE_HTML_PAGE,
             "%s<br>Send I for menu\n*** INCREASE MAXSIZE_HTML_PAGE (need %u) ***<br>",
             index_html_top, (unsigned)totalLen);
    return;
   }
 
 memcpy(HTML_page + i, index_html_top,    topLen);     i += topLen;
 memcpy(HTML_page + i, html_info,         infoLen);    i += infoLen;
 memcpy(HTML_page + i, index_html_footer, footerLen);  i += footerLen;
 HTML_page[i] = 0;
}

//--------------------------------------------                                                //
// WIFI CheckWIFIcommand
//--------------------------------------------
void CheckWIFIcommand(void)
{
 if (PendingCommand.length() > 0)
  {
   ReworkInputString(PendingCommand);
   BuildHTMLPage(false);                                                                      // Rebuild page after command; no logging (only i/ii should log the menu) 
  }
}
//--------------------------------------------                                                //
// WIFI WEBPAGE
//--------------------------------------------
void WebPage(void)
{
 BuildHTMLPage(true);                                                                         // Build initial page at startup with logging enabled
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                                  // Send web page with input fields to client
   {  request->send(200, "text/html",(const char*) HTML_page  );  }    ); 
 server.on("/log", HTTP_GET, [](AsyncWebServerRequest *request)                               // Serve the log viewer HTML page
   {  request->send(200, "text/html", logData);    });                                        // Serve the HTML page from LogViewer.h
 server.on("/tekstprint",  HTTP_GET, HandleTekstPrint);                                       // LOGBUFFER Printlast 500 lines
 server.on("/tekstdownload", HTTP_GET, HandleTekstDownload);                                  // LOGBUFFER Stream all the circular log buffer directly to the client
 server.on("/colourpick", HTTP_GET, [](AsyncWebServerRequest *request)
  {
  String page = ColourPick_html;
  char buf[12];
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourNL);     page.replace("%%COLNL%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourDE);     page.replace("%%COLDE%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourFR);     page.replace("%%COLFR%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourUK);     page.replace("%%COLUK%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.DimmedLetter); page.replace("%%COLBG%%", buf);
  request->send(200, "text/html", page);
  });
 server.on("/menu", HTTP_GET, [](AsyncWebServerRequest *request)                              // Serve the settings menu page
   {  request->send(200, "text/html", menu_html);  });

 server.on("/menustate", HTTP_GET, [](AsyncWebServerRequest *request)                         // Return current Mem toggle states as JSON
  {
   char json[420];
   snprintf(json, sizeof(json),
     "{\"t0\":%d,\"t1\":%d,\"t2\":%d,\"t3\":%d,\"t5\":%d,\"t8\":%d,"
     "\"tj\":%d,\"tself\":%d,\"tdemo\":%d,\"t9\":%d,"
     "\"hi\":\"h0%d\",\"qval\":%d,"
     "\"sval\":%d,\"lval\":%d,\"mval\":%d,"
     "\"noff\":%d,\"non\":%d,"
     "\"ds3231hw\":%d,\"rtcsrc\":\"%s\"}",
     Mem.HetIsWasOff      ? 0 : 1,  // t0 )  HET IS WAS ON when HetIsWasOff==0
     Mem.EdSoftLEDSOn     ? 1 : 0,  // t1 (
     LEDsAreOff           ? 0 : 1,  // t2 O  ON when display is on
     Mem.StatusLEDOn      ? 1 : 0,  // t3 P
     Mem.NTPOn            ? 1 : 0,  // t5 X
     Mem.Ringbufcnt       ? 1 : 0,  // t8 }
     Mem.UseDS3231        ? 1 : 0,  // tj J
     Zelftest             ? 1 : 0,  // tself #
     Demo                 ? 1 : 0,  // tdemo U
     Mem.TimeReceiver     ? 1 : 0,  // t9 H05
     (int)Mem.TimeInput,            // hi  h00-h04
     (int)Mem.DisplayChoice,        // qval Q0-Q8
     (int)Mem.LightReducer,         // sval S
     (int)Mem.LowerBrightness,      // lval L
     (int)Mem.UpperBrightness,      // mval M
     (int)Mem.TurnOffLEDsAtHH,      // noff N off-hour
     (int)Mem.TurnOnLEDsAtHH,       // non  N on-hour
     DS3231Installed      ? 1 : 0,  // ds3231hw hardware present
     (Mem.UseDS3231 && DS3231Installed) ? "DS3231" :
       (Mem.NTPOn ? "NTP" : "ESP32") // rtcsrc active time source
   );
   request->send(200, "application/json", json);
  });

 server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request)
   {
    String inputMessage;
    if (request->hasParam(PARAM_INPUT_1)) {inputMessage = request->getParam(PARAM_INPUT_1)->value();}
    PendingCommand = inputMessage;                                                            //  Command → queue it and redirect
    request->redirect("/wait");
});

